#include "../include/AsciiArt.h"

void ASCII_AST_01(){

    printf("\n\n     _.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._\n");
    printf("   ,'_.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._`.\n");
    printf("  ( (                                                         ) )\n");
    printf("   ) )                                                       ( (\n");
    printf("  ( (        Bem vindo ao nosso jogo de adivinhação           ) )\n");
    printf("   ) )                                                       ( (\n");
    printf("  ( (     O computador sorteou um número entre 1 e 100.       ) )\n");
    printf("   ) )   Seu obejtivo é descobrir esse número com o menor    ( (\n");
    printf("  ( (     número de tentativas possíveis, a cada nova         ) )\n");
    printf("   ) )   tentativa você irá perder pontos, então, adote      ( (\n");
    printf("  ( (     uma boa estratégia para vencer seus amigos :)       ) )\n");
    printf("   ) )                                                       ( (\n");
    printf("  ( (_.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._) )\n");
    printf("   `._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._.-._,'\n\n");
    printf("                                  |>>>\n");                              
    printf("                                  |\n");                                 
    printf("                    |>>>      _  _|_  _         |>>>\n");                
    printf("                    |        |;| |;| |;|        |\n");                   
    printf("                _  _|_  _    \\\\.    .  /    _  _|_  _\n");               
    printf("               |;|_|;|_|;|    \\\\:. ,  /    |;|_|;|_|;|\n");              
    printf("               \\\\..      /    ||;   . |    \\\\.    .  /\n");              
    printf("                \\\\.  ,  /     ||:  .  |     \\\\:  .  /\n");               
    printf("                 ||:   |_   _ ||_ . _ | _   _||:   |\n");                
    printf("                 ||:  .|||_|;|_|;|_|;|_|;|_|;||:.  |\n");                
    printf("                 ||:   ||.    .     .      . ||:  .|\n");                
    printf("                 ||: . || .     . .   .  ,   ||:   |       \\,/\n");      
    printf("                 ||:   ||:  ,  _______   .   ||: , |            /`\\\n");
    printf("                 ||:   || .   /+++++++\\    . ||:   |\n");                
    printf("                 ||:   ||.    |+++++++| .    ||: . |\n");                
    printf("              __ ||: . ||: ,  |+++++++|.  . _||_   |\n");                
    printf("     ____--`~    '--~~__|.    |+++++__|----~    ~`---,\n");               
    printf("-~--~                   ~---__|,--~'                  ~~----_____-~'\n\n\n");

}

void ASCII_AST_02(){

    printf("\n\n                    *****************\n");
    printf("               ******               ******\n");
    printf("           ****                           ****\n");
    printf("        ****                                 ***\n");
    printf("      ***                                       ***\n");
    printf("     **           ***               ***           **\n");
    printf("   **           *******           *******          ***\n");
    printf("  **            *******           *******            **\n");
    printf(" **             *******           *******             **\n");
    printf(" **               ***               ***               **\n");
    printf("**                                                     **\n");
    printf("**       *                                     *       **\n");
    printf("**      **                                     **      **\n");
    printf(" **   ****                                     ****   **\n");
    printf(" **      **                                   **      **\n");
    printf("  **       ***                             ***       **\n");
    printf("   ***       ****                       ****       ***\n");
    printf("     **         ******             ******         **\n");
    printf("      ***            ***************            ***\n");
    printf("        ****                                 ****\n");
    printf("           ****                           ****\n");
    printf("               ******               ******\n");
    printf("                    ***************** \n\n"); 

}

void ASCII_AST_03(){

    printf("\n\n                    @@@@@@@@@@@@@@@@@@@ \n");
    printf("                 @@@@@@             @@@@@@@ \n");                
    printf("              @@@@                       @@@@ \n");             
    printf("             @@@                             @@ \n");           
    printf("            @@                                @@  \n");         
    printf("           @@                                 @@  \n");
    printf("          @@                                   @@ \n");         
    printf("          @@ @@                             @@ @@ \n");        
    printf("          @@ @@                             @@  @ \n");       
    printf("          @@ @@                             @@  @ \n");       
    printf("          @@  @@                            @@ @@ \n");      
    printf("          @@  @@                           @@  @@ \n");     
    printf("           @@ @@   @@@@@@@@     @@@@@@@@   @@ @@ \n");  
    printf("            @@@@ @@@@@@@@@@     @@@@@@@@@@ @@@@@ \n");  
    printf("             @@@ @@@@@@@@@@     @@@@@@@@@@ @@@ \n");             
    printf("    @@@       @@  @@@@@@@@       @@@@@@@@@  @@      @@@@ \n");  
    printf("   @@@@@     @@   @@@@@@@   @@@   @@@@@@@   @@     @@@@@@ \n");
    printf("  @@   @@    @@     @@@    @@@@@    @@@     @@    @@   @@ \n");
    printf(" @@@    @@@@  @@          @@@@@@@          @@  @@@@    @@@ \n");
    printf("@@         @@@@@@@@       @@@@@@@       @@@@@@@@@        @@ \n");
    printf("@@@@@@@@@     @@@@@@@@    @@@@@@@    @@@@@@@@      @@@@@@@@ \n");
    printf("  @@@@ @@@@@      @@@@@              @@@ @@     @@@@@@ @@@ \n");
    printf("          @@@@@@  @@@  @@           @@  @@@  @@@@@@ \n");       
    printf("              @@@@@@ @@ @@@@@@@@@@@ @@ @@@@@@  \n");            
    printf("                  @@ @@ @ @ @ @ @ @ @ @ @@    \n");             
    printf("                @@@@  @ @ @ @ @ @ @ @   @@@@@   \n");           
    printf("            @@@@@ @@   @@@@@@@@@@@@@   @@ @@@@@\n");            
    printf("    @@@@@@@@@@     @@                 @@      @@@@@@@@@  \n");  
    printf("   @@           @@@@@@@             @@@@@@@@          @@  \n"); 
    printf("    @@@     @@@@@     @@@@@@@@@@@@@@@     @@@@@     @@@  \n");  
    printf("      @@   @@@           @@@@@@@@@           @@@   @@   \n");   
    printf("      @@  @@                                   @@  @@  \n");    
    printf("       @@@@                                     @@@@   \n\n");
}